namespace VRFest.Scripts.Game.Constants
{
    public static class EducationConstants
    {
        public static readonly string FIRST = "Ты стоишь дороге, где по трассе мчатся машины разных размеров. Они могут ехать быстро или медленно, но все направляются прямо к тебе! Твоя задача — увернуться от них. Чем точнее ты уклоняешься, тем больше очков получаешь.";
        public static readonly string SECOND = "В небе появляются яркие звёзды — одни близко, другие далеко. У тебя есть рогатка, которая стреляет мягкими шариками. Выбери правильную звезду, оцени расстояние и выстрели по ней! Чёткий выстрел приносит очки и открывает новые цели.";
        public static readonly string THIRD = "К тебе движутся монстры и ты должен остановить их, пока они не пересекли кристаллы, обозначающие опасную зону. Нажми на кнопку заморозки вовремя. Будь внимателен: каждый монстр идёт своим темпом!\n";
        public static readonly string FOURTH = "Злая ведьма околдовала твои любимые игрушки, и теперь они летят в твою сторону! Твоя задача — ловко уклоняться от них. Чем аккуратнее ты избегаешь столкновений, тем больше очков получаешь и тем быстрее снимаешь заклятие.";
        public static readonly string FIFTH = "Фея пригласила тебя на волшебное чаепитие, но её сад перепутан: чашки, блюдца и куклы стоят не на своих местах. Ты должна помочь ей — аккуратно взять предмет и поставить его туда, где он должен быть: ближе или дальше в саду. Чем точнее расставишь сервис, тем довольнее будет фея!";
        public static readonly string SIXTH = "По саду летят разноцветные бабочки. Одни рядом, другие — вдалеке. У тебя есть сачок, и твоя задача — поймать пролетающую бабочку. Каждая пойманная бабочка приносит очки и открывает новые виды.";
    }
}